Tekla Open API Reference for Tekla Structures 2025
RebarHookData.RebarHookShapeEnum Enumeration
 The different hook shapes.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarHookShapeEnum
Public Enumeration RebarHookShapeEnum
Members
Member name | Value | Description
NO_HOOK | 0 |  No hook.
HOOK_90_DEGREES | 1 |  The standard 90-degree hook.
HOOK_135_DEGREES | 2 |  The standard 135-degree hook.
HOOK_180_DEGREES | 3 |  The standard 180-degree hook.
CUSTOM_HOOK | 4 |  The custom hook shape to manually define the angle, radius and length of a hook.
See Also
Reference
Tekla.Structures.Model Namespace